# Analise de planilhas de vendas

## Importação dos pacotes e dos arquivos .xlsx

In [1]:
# Importação dos pacotes necessa´rios
import pandas as pd
import seaborn as sn
import matplotlib.pyplot as plt

In [2]:
# Carregando cada planilha em um dataframe diferenre
df1 = pd.read_excel("Aracaju.xlsx")
df2 = pd.read_excel("Fortaleza.xlsx")
df3 = pd.read_excel("Natal.xlsx")
df4 = pd.read_excel("Recife.xlsx")
df5 = pd.read_excel("Salvador.xlsx")

## Junção dos dataframes e interações básicas

In [3]:
#usando método de conctenação para junção dos dataframes criados
df_lojas = pd.concat([df1,df2,df3,df4,df5])

In [4]:
# Verificando as primeiras limhas do df_lojas
df_lojas.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [5]:
# Verificndo as 5 últimas linhas do df_lojas
df_lojas.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [6]:
# verificando linhas aleatórias do df_lojas
df_lojas.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
12   Fortaleza 2019-01-01   80.73    1004     2
124    Aracaju 2018-01-01  139.64    1522     5
94       Natal 2019-01-02   33.24    1037     1
47     Aracaju 2018-01-01   80.46    1520     2
73       Natal 2018-01-05  773.00     852     2

In [7]:
# Verificando o tipo de dado de cada coluna
df_lojas.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

## Alterando tipo de dados de uma coluna e verificalção de ddos faltantes (*missing values*)

O tipo de dado da coluna LojaID pe numérico, porém, como não será utilizado em cálculos, elem será convertido nop tipo object.

In [8]:
#Alterando o tipo de dado da coluna LojaID
df_lojas["LojaID"] = df_lojas["LojaID"].astype("object")

In [9]:
# Verificando o resultado da conversão
df_lojas.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [10]:
#C Verificando a existência de linhas com dados faltantes
df_lojas.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [13]:
#Substituindo os valores nulos pela média
df_lojas["Vendas"].fillna(df_lojas["Vendas"].mean(), inplace=True)

In [ ]:
df["Vendas"].mean()

In [ ]:
df.isnull().sum()

In [ ]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)